import numpy as np

dates = set(["Итальянец", "Путевой", "90e", "Aрт", "Нано", "Аква", "Скоростной", "Фото",
           "4друга", "Спа", "Гриин", "Азия"])

desc = {
    "Итальянец": {"Cтоимость": 3,
                  "Район": "Центральный",
                  "Вид отдыха": ["Интерактивный", "Релакс", "Контент для сетей"],
                  "Длительность": 4,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Италия"
                 },
    
    "Путевой": {"Cтоимость": 2,
                  "Район": "Центральный",
                  "Вид отдыха": ["Культурный", "Интерактивный", "Семейный"],
                  "Длительность": 4,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Поезд"
                 },
    
    "90e": {"Cтоимость": 3,
                  "Район": "Центральный",
                  "Вид отдыха": ["Интерактивный", "Активный", "Контент для сетей"],
                  "Длительность": 6,
                  "Количество": ["Компания"],
                  "Слово": "Девяностые"
                 },
    
    "Арт": {"Cтоимость": 2,
                  "Район": "Центральный",
                  "Вид отдыха": ["Интерактивный", "Искусство", "Контент для сетей"],
                  "Длительность": 4,
                  "Количество": ["Пара"],
                  "Слово": "Искуство"
                 },
    
    "Нано": {"Cтоимость": 1,
                  "Район": "Центральный",
                  "Вид отдыха": ["Интерактивный", "Семейный"],
                  "Длительность": 4,
                  "Количество": ["Компания"],
                  "Слово": "Технологии"
                 },
    
    "Аква": {"Cтоимость": 3,
                  "Район": "Центральный",
                  "Вид отдыха": ["Релакс", "Интерактивный", "Семейный"],
                  "Длительность": 6,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Океан"
                 },
    
    "Скоростной": {"Cтоимость": 2,
                  "Район": "Петроградский",
                  "Вид отдыха": ["На открытом воздухе", "Культурный", "Активный"],
                  "Длительность": 4,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Самокат"
                 },
    
    "Фото": {"Cтоимость": 3,
                  "Район": "Василеостровский",
                  "Вид отдыха": ["Искусство", "Контент для сетей"],
                  "Длительность": 6,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Контент"
                 },
    
    "4друга": {"Cтоимость": 1,
                  "Район": "Центральный",
                  "Вид отдыха": ["Интерактивный", "Контент для сетей", "Активный"],
                  "Длительность": 6,
                  "Количество": ["Компания"],
                  "Слово": "С друзьями"
                 },
    
    "Спа": {"Cтоимость": 2,
                  "Район": "Петроградский",
                  "Вид отдыха": ["Релакс", "Семейный"],
                  "Длительность": 4,
                  "Количество": ["Компания"],
                  "Слово": "SPA"
                 },
    
    "Грин": {"Cтоимость": 1,
                  "Район": "Петроградский",
                  "Вид отдыха": ["Релакс", "На открытом воздухе", "Семейный"],
                  "Длительность": 2,
                  "Количество": ["Пара"],
                  "Слово": "Флора"
                 },
    
    "Азия": {"Cтоимость": 2,
                  "Район": "Центральный",
                  "Вид отдыха": ["Искусство", "На открытом воздухе"],
                  "Длительность": 4,
                  "Количество": ["Пара", "Компания"],
                  "Слово": "Азия"
                 },
    
}

#Сколько потратим
def filter_cost(dates, desc, cost):
    set_dates = set()
    for date in desc.keys():
        if cost == 1 and desc[date]["Cтоимость"] > 1:
            set_dates.add(date)
            
        elif cost == 2 and desc[date]["Cтоимость"] > 2:
            set_dates.add(date)
            
    res = dates - set_dates
    return res if len(res) else dates

#Район
def filter_area(dates, desc, area):
    set_dates = set()
    for date in desc.keys():
        if area == "Центральный" and desc[date]["Район"] != "Центральный":
            set_dates.add(date)
            
        elif area == "Петроградский" and desc[date]["Район"] != "Петроградский":
            set_dates.add(date)
            
        elif area == "Василеостровский" and desc[date]["Район"] != "Василеостровский":
            set_dates.add(date)
            
    res = dates - set_dates
    return res if len(res) else dates

#Вид отдыха
def filter_leisure(dates, desc, leisures):
    set_dates = set()
    for date in desc.keys():
        approached = False
        for leis in leisures:
            if leis in desc[date]["Вид отдыха"]:
                approached = True
        
        if not approached:
            set_dates.add(date)

    res = dates - set_dates
    return res if len(res) else dates

#Длительность
def filter_duration(dates, desc, time):
    set_dates = set()
    for date in desc.keys():
        if time == 2 and desc[date]["Длительность"] > 2:
            set_dates.add(date)
            
        elif time == 4 and desc[date]["Длительность"] > 4:
            set_dates.add(date)
            
    res = dates - set_dates
    return res if len(res) else dates
#Слово
def definition_word(dates):
    if len(dates) <= 3:
        return list(dates)
    else:
        arr = np.array(list(dates))
        np.random.shuffle(arr)
        return arr[:3]
        
if __name__ == '__main__':
	dates = filter_cost(dates, desc, 2)
	dates = filter_area(dates, desc, "Центральный")
	dates = filter_leisure(dates, desc, ["Релакс", "Интерактивный", "Культурный"])
	dates = filter_duration(dates, desc, 6)
	dates = definition_word(dates)
	print(dates)
